# Rebar Create From Curves And Shape(Document, Rebar Shape, Rebar Bar Type, Element, XYZ, IList Curve , Bar Terminations Data) Method

Source: https://www.revitapidocs.com/2026/2ae9c77b-06e2-66c3-6efa-e01abf8115ab.htm

---

| Rebar Create From Curves And Shape(Document, Rebar Shape, Rebar Bar Type, Element, XYZ, IList Curve , Bar Terminations Data) Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static Rebar CreateFromCurvesAndShape(
	Document doc,
	RebarShape rebarShape,
	RebarBarType barType,
	Element host,
	XYZ norm,
	IList<Curve> curves,
	BarTerminationsData barTerminationsData
)
```

```
Public Shared Function CreateFromCurvesAndShape (
	doc As Document,
	rebarShape As RebarShape,
	barType As RebarBarType,
	host As Element,
	norm As XYZ,
	curves As IList(Of Curve),
	barTerminationsData As BarTerminationsData
) As Rebar
```

```
public:
static Rebar^ CreateFromCurvesAndShape(
	Document^ doc,
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	Element^ host,
	XYZ^ norm,
	IList<Curve^>^ curves,
	BarTerminationsData^ barTerminationsData
)
```

```
static member CreateFromCurvesAndShape :
        doc : Document *
        rebarShape : RebarShape *
        barType : RebarBarType *
        host : Element *
        norm : XYZ *
        curves : IList<Curve> *
        barTerminationsData : BarTerminationsData -> Rebar
```

#### Parameters

doc Document
rebarShape RebarShape
barType RebarBarType
host Element
norm XYZ
curves IList Curve
barTerminationsData BarTerminationsData

#### Return Value

Rebar See Also

#### Reference

Rebar Class CreateFromCurvesAndShape Overload Autodesk.Revit.DB.Structure Namespace